Repository: bedmondmark/crochet-cad
Catalog: crocad/locale/*.po
Languages: fi

source: Global Options
fi: Globaalit valinnat

source: Global options must be provided before the name of the crochet-cad COMMAND. They can be used with all crochet-cad commands.
fi: Globaalit valinnat taytyy antaa ennen crochet-cad-komennon nimea. Niita voi kayttaa kaikkien crochet-cad-komentojen yhteydessa.

source: print out extra information - only really used for debugging.
fi: tulosta enemman informaatiota - kaytetaan vain vianetsintaan.

source: generate an exact pattern which may not produce such an even end-product.
fi: generoi tarkka kaava, joka ei ehka tuota tasaista lopputulosta.

source: Instead of printing instructions, just print the row-counts, one per line.
fi: Ohjeiden sijaan tulosta vain kerrosten lukemat, yksi per rivi.

source: No command was provided.
fi: Komentoa ei annettu.

source: Ball - radius: %.2f, row-angle: %.2f rads
fi: Pallo - säde: %.2f, kerroskulma: %.2f radiaania

source: Circumference: %.2f
fi: Ympärysmitta: %.2f

source: the number of rows in the pattern. Defines the size of the ball - the circumference is 2x this value. [%default]
fi: Kerrosten lukumäärä kaavassa. Määrittää pallon koon - ympärysmitta on 2x tämä arvo. [%default]

source: Ball (%d rows)
fi: Pallo (%d kerrosta)

source: Row %d, Stitches: %.2f
fi: Kerros %d, Silmukoita: %.2f

source: the number of rows in the pattern. Defines the height of the cone [%default]
fi: Kerrosten lukumäärä kaavassa. Määrittää kartion korkeuden [%default]

source: the number of stitches at the base of the pattern. Defines the circumference of the base of the cone [%default]
fi: silmukoiden lukumäärä kuvion alareunassa. Määrittää kartion pohjan ympärysmitan [%default]

source: Cone (%d rows, %d max-circumference)
fi: Kartio (%d kierrosta, %d max-ympärysmitta)

source: Actual stitch-count: %.18f
fi: Tarkka silmukoiden lukumäärä: %.18f

source: the circumference of the donut hole, in stitches [%default]
fi: donitsin reiän ympärysmitta, silmukoina [%default]

source: the number of rows in the pattern - defines the 'thickness' of the donut [%default]
fi: kerrosten lukumäärä kaavassa - määrittää donitsin 'paksuuden' [%default]

source: Donut (inner-radius: %d, %d rows)
fi: Donitsi (sisäsäde: %d, %d kerrosta)

source: %s in next %d
fi: %s seuraavaan %d

source: {together_count}{stitch}tog
fi: {together_count} {stitch} yhteen

source: in next %d
fi: seuraavaan %d

source: sc
fi: ks

source: %d%s in each
fi: %d%s jokaiseen

source: Make a magic circle, 6sc into centre.
fi: Tee taikarengas, 6 ks keskustaan.

source: ch %d, sc in each chain
fi: %d kjs, ks jokaiseen kjs:aan

source: sc in each sc
fi: ks jokaiseen ks:aan

source: pc: %d, diff: %.4f
fi: pc: %d, ero: %.4f

source: , 2sc in next
fi: , 2 ks seuraavaan

source: , sc2tog
fi: , 2 ks yhteen

source: result: %s
fi: tulos: %s

source: , %dsc
fi: , %d ks

source: , repeat from * %d times
fi: , toista *:sta %d kertaa

source: %dsc
fi: %d ks

source: Row {row_number}: {instructions} ({stitch_count})
fi: {row_number}. krs: {instructions}({stitch_count})

source: <div class="instruction">Row %d:
fi: <div class="instruction">%d. krs::
